cricket2009/SpO2_MSP430/MSP430F5528/AFE44x0_main.c
    // SD卡初始化
//    while(SD_Initialize());
//    exfuns_init();      // 申请文件系统内存
//    f_mount(0,fs);      // 挂载文件系统  
//    f_mkdir("0:S");     // 创建文件夹
    pingPongBuf_ForSD = NULL;
    
     //首页面显示
    OLED_ShowString(SPO2_Symbol_Start_X,SPO2_Symbol_Start_Y,16,"SpO2%");
    OLED_ShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"PR");   
    Show_Wait_Symbol("Off_IDLE");
    OLED_Refresh_Gram();
    delay(500000);  
    //Init_TimerA1();
    //开启全局总中断
    __enable_interrupt();            //Enable interrupts globally

 
    while (1)
    {
      if(SpO2SystemStatus == SpO2_OFFLINE_IDLE || SpO2SystemStatus == SpO2_ONLINE_IDLE)
      {
        // 释放空间
        PingPongBufFree(pingPongBuf_ForSD);
        pingPongBuf_ForSD = NULL;
        bufferFullFlag  = 0;
        // 关闭文件
//      f_close(file);
        //打开显示器
        OLED_SLEEP(0);     
        if(Device_waite_time1 <5000)
        {
          delay(3000);
          Device_waite_time1++;
        }
        else
        {
           if(SpO2SystemStatus == SpO2_OFFLINE_IDLE)
             SpO2SystemStatus = SpO2_OFF_SLEEP;
           else if(SpO2SystemStatus == SpO2_ONLINE_IDLE)
             SpO2SystemStatus = SpO2_ON_SLEEP;
        }     
      }
      else if(SpO2SystemStatus == SpO2_OFF_SLEEP || SpO2SystemStatus == SpO2_ON_SLEEP)    //进入离线睡眠状态
      {
        // 释放空间
        PingPongBufFree(pingPongBuf_ForSD);
        pingPongBuf_ForSD = NULL;
        bufferFullFlag  = 0;
        // 关闭文件
//        f_close(file);
        
        //关闭显示器
        OLED_SLEEP(1);
        //关闭AFE4400
        AFE44xx_PowerOff();
        //关闭AFE4400的中断
        Disable_AFE44xx_DRDY_Interrupt();
        //进入低功耗
        _BIS_SR(LPM3_bits + GIE);
      }
      else if(SpO2SystemStatus == SpO2_OFFLINE_MEASURE || SpO2SystemStatus == SpO2_ONLINE_MEASURE)  //在线或离线测量状态
      { 
        if(bufferFullFlag  == 1) // 写入SD卡
        {
          PingPongBufRead(pingPongBuf_ForSD,&dataTemp);
//        f_write(file,buff,512,&bw);
          bufferFullFlag  = 0;
        }
        if (readDataFlag)        // 采用频率80Hz，每秒readDataFlag有80次等于1
        {
          readDataFlag = 0;
          cycle_num++;  // 采样计数
          //更新OLE
          if(cycle_num == Fs)      // 每1s更新一次显示
          {
            cycle_num = 0;
            if(Finger_out)
            {
               if(Finger_out_num == 0)
               {
                 OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
                 OLED_ShowString(SPO2_Symbol_Start_X,30,16,"Finger Lose");
                 OLED_ShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空心型图标
                 OLED_Refresh_Gram();
                }
               if(Finger_out_num > 5) //5s都没有手指，即5次测量都没有手指,停止测量
               {
                 //关闭定时器中断
                 //TA1CCTL0 &= ~CCIE;
                 //关闭AFE4400的中断
                 Disable_AFE44xx_DRDY_Interrupt();
                 //关闭AFE4400
                 AFE44xx_PowerOff();
                 
                 OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
                 if(SpO2SystemStatus == SpO2_OFFLINE_MEASURE)   // 离线测量状态切换到离线空闲
                 {
                   SpO2SystemStatus = SpO2_OFFLINE_IDLE;
                   Show_Wait_Symbol("Off-IDLE");
                 }
                 else if(SpO2SystemStatus == SpO2_ONLINE_MEASURE) // 在线测量状态切换到在线空闲
                 {
                   SpO2SystemStatus = SpO2_ONLINE_IDLE;
                   Show_Wait_Symbol("On-IDLE ");
                 }
                 
                 OLED_Refresh_Gram();
                 continue;
               }
              /*显示Finger Lose字样*/
              Finger_out_num++;
//              HR_diff_count = 0; // 心率值的次数计数置零
              continue;
            }
            else
            {
              Finger_out_num = 0;
               //计算HR(PR)             
               if(abs(HR_diff-HR_raw)<=2 && (HR_diff != HR_diff_old || HR_raw != HR_raw_old))
               {
                 HR = (HR_diff +HR_raw)/2;        // 脉率值 HR
                 if ((HR-HR_old)>3)               // 每次更新最大为 3 BPM
                 { 
                   HR = HR_old+3;
                 }
                 else if((HR_old-HR)>3)
                 {
                   HR = HR_old -3;
                 }
                 HR_old = HR;
                 HR_diff_old = HR_diff;
                 HR_raw_old = HR_raw;
               }
               //计算SPO2
               spo2 = (int)(spo2_instant1+0.5)+1;     // 血氧值 spo2, 加1作为校正量     
               if(spo2>100)
                 spo2 = 100;
              //清空原有的显示
              OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
              /*显示spo2 与HR值*/
              if(spo2<100)
                OLED_ShowNum(SPO2_Show2Num_Start_X,SPO2_Show2Num_Start_Y,spo2,2,32);              
              else
                OLED_ShowNum(SPO2_Show3Num_Start_X,SPO2_Show3Num_Start_Y,spo2,3,32);


//////////////////////////////////////////////////////////              
              if(HR_OLED_flag)
              { 
////////////////////////////////////////////////////////             
                if(HR < 100)
                  OLED_ShowNum(HR_Show2Num_Start_X,HR_Show2Num_Start_Y,HR,2,32);              
                else
                  OLED_ShowNum(HR_Show3Num_Start_X ,HR_Show3Num_Start_Y,HR,3,32);
/////////////////////////////////////////////////////////
              }//if(HR_OLED_flag)
              else
              {
                 OLED_ShowWaitSymbol(HR_Wait_Symbol_Start_X,HR_Wait_Symbol_Start_Y,1);
                 OLED_ShowWaitSymbol(HR_Wait_Symbol_Start_X+16,HR_Wait_Symbol_Start_Y,1);
                 OLED_ShowWaitSymbol(HR_Wait_Symbol_Start_X+32,HR_Wait_Symbol_Start_Y,1);
              }
////////////////////////////////////////////////////////
              if(cycle_num_OLED == 0)
              {
                OLED_ShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,1); //大心
                cycle_num_OLED = 1;
              }
              else
              {
                OLED_ShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //无心
                cycle_num_OLED = 0;                
              }
              OLED_Refresh_Gram();
              continue;
            }
          }
        } //if(readDataFlag) 
      }
   }  //while(1)
} //main()



