cricket2009/SpO2_MSP430/MSP430F5528/AFE44x0_main.c
void SendRedAndIRToCC2530(uint32 REDdata,uint32 IRdata,uint16 SpO2_temp,uint16 HR_temp)
{
  uint8 temp = writeNum*8;
  bufferSendToCC2530[temp++] = (REDdata & 0xFF);
  bufferSendToCC2530[temp++] = (REDdata & 0xFF00) >> 8;
  bufferSendToCC2530[temp++] = (REDdata & 0xFF0000) >> 16;
  bufferSendToCC2530[temp++] = (REDdata & 0xFF000000) >> 24;
  bufferSendToCC2530[temp++] = (IRdata & 0xFF);
  bufferSendToCC2530[temp++] = (IRdata & 0xFF00) >> 8;
  bufferSendToCC2530[temp++] = (IRdata & 0xFF0000) >> 16;
  bufferSendToCC2530[temp++] = (IRdata & 0xFF000000) >> 24;
  writeNum++;
  if(writeNum == 8)
  {
    bufferSendToCC2530[temp++] = (SpO2_temp & 0xFF);
    bufferSendToCC2530[temp++] = (SpO2_temp & 0xFF00) >> 8;
    bufferSendToCC2530[temp++] = (HR_temp & 0xFF);
    bufferSendToCC2530[temp++] = (HR_temp & 0xFF00) >> 8;
    UART1_Send_Buffer(bufferSendToCC2530,68);
    writeNum = 0;
  }
}


/*********************************************************************
 * @fn      GenericApp_GetWriteName
 *
 * @brief   Get the RTC time and make file name.
 *
 * @param   char *
 *          0:D/20xx-xx-xx xx-xx-xx x.txt + \0 = 30Byte
 *
 * @return  
 *
 */
void GenericApp_GetWriteName(void)
{
  RTCStruct_t RTCStruct;
  HalRTCGetOrSetFull(RTC_DS1302_GET,&RTCStruct);

  // Make file name
  fileName[0] = '0';
  fileName[1] = ':';
  fileName[2] = 'S';
  fileName[3] = '/';
  fileName[4] = '2';
  fileName[5] = '0';
  fileName[6] = RTCStruct.year/10 + '0';
  fileName[7] = RTCStruct.year%10 + '0';
  fileName[8] = '-';
  fileName[9] = RTCStruct.month/10 + '0';
  fileName[10] = RTCStruct.month%10 + '0';
  fileName[11] = '-';
  fileName[12] = RTCStruct.date/10 + '0';
  fileName[13] = RTCStruct.date%10 + '0';
  fileName[14] = ' ';
  fileName[15] = RTCStruct.hour/10 + '0';
  fileName[16] = RTCStruct.hour%10 + '0';
  fileName[17] = '-';
  fileName[18] = RTCStruct.min/10 + '0';
  fileName[19] = RTCStruct.min%10 + '0';
  fileName[20] = '-';
  fileName[21] = RTCStruct.sec/10 + '0';
  fileName[22] = RTCStruct.sec%10 + '0';
  fileName[23] = ' ';  
  fileName[24] = RTCStruct.week + '0';
  fileName[25] = '.';
  fileName[26] = 't';
  fileName[27] = 'x';
  fileName[28] = 't';
  fileName[29] = '\0';
}

